JinxinHu/MSP430f5529/temperature measurement/HAL_Dogs102x6.c
    // Row boundary check
    if (row > 7)
    {
        row = 7;
    }

    // Column boundary check
    if (col > 101)
    {
        col = 101;
    }

    // handle characters not in our table
    if (f < 32 || f > 129)
    {
        // replace the invalid character with a '.'
        f = '.';
    }

    // subtract 32 because FONT6x8[0] is "space" which is ascii 32,
    // multiply by 6 because each character is columns wide
    h = (f - 32) * 6;

    Dogs102x6_setAddress(row, col);
    if (style == DOGS102x6_DRAW_NORMAL)
    {
        // write character
        Dogs102x6_writeData((uint8_t *)FONT6x8 + h, 6);
    }
    else
    {
        for (b = 0; b < 6; b++)
        {
            // invert the character
            inverted_char[b] = FONT6x8[h + b] ^ 0xFF;
        }
        // write inverted character
        Dogs102x6_writeData(inverted_char, 6);
    }
}

/***************************************************************************//**
 * @brief   Writes a character from FONT6x8[] array to the LCD at (x,y).
 *
 *          (0,0) is the upper left corner of screen.
 * @param   x Horizontal coordinate (0 - 102)
 * @param   y Vertical coordinate (0 - 63)
 * @param   f Pointer to the character to be written to the LCD
 * @param   style The style of the text
 *                - NORMAL = 0 = dark letters with light background
 *                - INVERT = 1 = light letters with dark background
 * @return  None
 ******************************************************************************/

void Dogs102x6_charDrawXY(uint8_t x, uint8_t y, uint16_t f, uint8_t style)
{
    // Each Character consists of 6 Columns 8 pixels tall
    uint8_t b, row;
    uint16_t h;
    uint8_t desired_char[12];

    // make sure we won't be writing off the screen
    if (x >= 102)
    {
        x = 101;
    }
    if (y >= 64)
    {
        y = 63;
    }

    // handle characters not in our table
    if (f < 32 || f > 129)
    {
        // replace the invalid character with a '.'
        f = '.';
    }

    // subtract 32 because FONT6x8[0] is "space" which is ascii 32,
    // multiply by 6 because each character is 6 columns wide
    h = (f - 32) * 6;

    // Check if there is a remainder
    row = y >> 3;                        // identical to: row = y / 8;

    if (style == DOGS102x6_DRAW_NORMAL)
    {
        for (b = 0; b < 6; b++)
        {
            desired_char[b] =
                (FONT6x8[h + b] >> (y % 8)) | dogs102x6Memory[2 + (row * 102) + x + b];
            desired_char[b + 6] =
                FONT6x8[h + b] << (8 - y % 8) | dogs102x6Memory[2 + ((row + 1) * 102) + x + b];
        }
    }
    else
    {
        for (b = 0; b < 6; b++)
        {
            desired_char[b] = (FONT6x8[h + b] ^ 0xFF) >> (y & 0x07);         // identical to: (y % 8);
            desired_char[b + 6] = (FONT6x8[h + b] ^ 0xFF) << (8 - y & 0x07); // identical to: y % 8);
        }
    }
    Dogs102x6_setAddress(row, x);
    // write first line of character
    Dogs102x6_writeData(desired_char, 6);
    Dogs102x6_setAddress(row + 1, x);
    // write second line of character
    Dogs102x6_writeData(desired_char + 6, 6);
}

/***************************************************************************//**
 * @brief   Writes a String to the LCD at (row,col).
 *
 *          (0,0) is the upper left corner of screen.
 * @param   row Page Address (there are 8 pages on the screen, each is 8 pixels
 *          tall) (0 - 7)
 * @param   col Column Address (there are 102 columns on the screen) (0 - 101)
 * @param   word[] Pointer to the String to be written to the LCD
 * @param   style The style of the text
 *                - NORMAL = 0 = dark letters with light background
 *                - INVERT = 1 = light letters with dark background
 * @return  None
 ******************************************************************************/

void Dogs102x6_stringDraw(uint8_t row, uint8_t col, char *word, uint8_t style)
{
    // Each Character consists of 6 Columns on 1 Page
    // Each Page presents 8 pixels vertically (top = MSB)
    uint8_t a = 0;

    // Row boundary check
    if (row > 7)
    {
        row = 7;
    }

    // Column boundary check
    if (col > 101)
    {
        col = 101;
    }

    while (word[a] != 0)
    {
        // check for line feed '/n'
        if (word[a] != 0x0A)
        {
            //check for carriage return '/r' (ignore if found)
            if (word[a] != 0x0D)
            {
                //Draw a character
                Dogs102x6_charDraw(row, col, word[a], style);

                //Update location
                col += 6;

                //Text wrapping
                if (col >= 102)
                {
                    col = 0;
                    if (row < 7)
                        row++;
                    else
                        row = 0;
                }
            }
        }
        // handle line feed character
        else
        {
            if (row < 7)
                row++;
            else
                row = 0;
            col = 0;
        }
        a++;
    }
}

/***************************************************************************//**
 * @brief   Writes a String to the LCD at (x,y).
 *
 *          (0,0) is the upper left corner of screen.
 * @param   x Horizontal coordinate
 * @param   y Vertical coordinate
 * @param   word[] Pointer to the String to be written to the LCD
 * @param   style The style of the text
 *                - NORMAL = 0 = dark letters with light background
 *                - INVERT = 1 = light letters with dark background
 * @return  None
 ******************************************************************************/

void Dogs102x6_stringDrawXY(uint8_t x, uint8_t y, char *word, uint8_t style)
{
    /* Each Character consists of 6 Columns on 1 Page
     * Each Page presents 8 pixels vertically (top = MSB)*/
    uint8_t a = 0;

    while (word[a] != 0)
    {
        // Draw a character
        Dogs102x6_charDrawXY(x, y, word[a], style);

