JinxinHu/MSP430f5529/temperature measurement/HAL_Dogs102x6.c
        // Update location
        x += 6;

        // Text wrapping
        if (x >= 102)
        {
            x = 0;
            if (y + 8 < 64)
                y += 8;
            else
                y = 0;
        }
        a++;
    }
}

/***************************************************************************//**
 * @brief   Clears one row/page (in memory as well).
 *
 *          Row 0 is at the top of the screen.
 * @param   row The row to be cleared (0~7)
 * @return  None
 ******************************************************************************/

void Dogs102x6_clearRow(uint8_t row)
{
    uint8_t cmd[] = {0};
    uint8_t a = 0;

    // Check row boundary
    if (row > 7)
    {
        row = 7;
    }

    Dogs102x6_setAddress(row, 0);
    for (a = 0; a < 102; a++)
    {
        Dogs102x6_writeData(cmd, 1);
//        dogs102x6Memory[2 + (row * 102) + a] = 0x00;   // this is already done in writeData
    }
}

/***************************************************************************//**
 * @brief  Draws a pixel at (x,y).
 *
 *          (0,0) is the upper left corner of screen.
 * @param  x x-coordinate of the point
 * @param  y y-coordinate of the point
 * @param   style The style of the pixel
 *                - NORMAL = 0 = dark pixel
 *                - INVERT = 1 = inverts pixel
 * @return None
 ******************************************************************************/

void Dogs102x6_pixelDraw(uint8_t x, uint8_t y, uint8_t style)
{
    uint8_t p, temp;

    //make sure we won't be writing off the screen
    if (x > 101)
    {
        x = 101;
    }

    if (y > 63)
    {
        y = 63;
    }

    //determine the page
    p = y >> 3;                        // identical to: p = y / 8;

    //determine height of pixel within the page
    temp = 0x80 >> (y & 0x07);         // identical to: temp = 0x80 >> (y % 8);

    //update our array
    if (style == DOGS102x6_DRAW_NORMAL)
        dogs102x6Memory[2 + (p * 102) + x] |= temp;
    else
        dogs102x6Memory[2 + (p * 102) + x] &= ~temp;

    Dogs102x6_setAddress(p, x);

    //draw pixel
    Dogs102x6_writeData(dogs102x6Memory + (2 + (p * 102) + x), 1);
}

/***************************************************************************//**
 * @brief   Draws a horizontal line on the LCD.
 *
 *          (0,0) is the upper left corner of screen.
 * @param   x1 The horizontal line starting pixel coordinate (0~101)
 * @param   x2 The horizontal line ending pixel coordinate (0~101)
 * @param   y  The height of the line (pixel row, not page) (0~63)
 * @param   style The style of the line
 *                - NORMAL = 0 = dark line, overwrites
 *                - INVERT = 1 = inverts color on line
 * @return  None
 ******************************************************************************/

void Dogs102x6_horizontalLineDraw(uint8_t x1, uint8_t x2, uint8_t y, uint8_t style)
{
    uint8_t temp = 0, p, a;

    //make sure we won't be writing off the screen
    if (x1 > 101)
    {
        x1 = 101;
    }

    if (x2 > 101)
    {
        x2 = 101;
    }

    if (y > 63)
    {
        y = 63;
    }

    //swap coordinates if x1 is past x2
    if (x1 > x2)
    {
        temp = x1;
        x1 = x2;
        x2 = temp;
    }

    //determine the page
    p = y >> 3;                        // identical to: p = y / 8;
    //determine height of line within the page
    temp = 0x80 >> (y & 0x07);         // identical to: temp = 0x80 >> (y % 8);

    a = x1;
    while (a <= x2)
    {
        if (style == DOGS102x6_DRAW_NORMAL)
        {
            //draws a dark line through everything
            dogs102x6Memory[2 + (p * 102) + a] |= temp;
        }
        else
        {
            //draws a light line through everything
            dogs102x6Memory[2 + (p * 102) + a] &= ~temp;
        }

        a++;
    }

    Dogs102x6_setAddress(p, x1);

    //draw the line
    Dogs102x6_writeData(dogs102x6Memory + (2 + (p * 102) + x1), x2 - x1 + 1);
}

/***************************************************************************//**
 * @brief   Draws a vertical line on the LCD.
 *
 *          (0,0) is the upper left corner of screen.
 * @param   y1 The vertical line starting pixel coordinate (0~63)
 * @param   y2 The vertical line ending pixel coordinate (0~63)
 * @param   x  The column of line (0~101)
 * @param   style The style of the line
 *                - NORMAL = 0 = dark line, overwrites
 *                - INVERT = 1 = inverts color on line
 * @return  None
 ******************************************************************************/

void Dogs102x6_verticalLineDraw(uint8_t y1, uint8_t y2, uint8_t x, uint8_t style)
{
    uint8_t temp1 = 0, temp2 = 0, p1, p2, a;

    //make sure we won't be writing off the screen
    if (y1 > 63)
    {
        y1 = 63;
    }

    if (y2 > 63)
    {
        y2 = 63;
    }

    if (x > 101)
    {
        x = 101;
    }

    //swap coordinates if y1 is past y2
    if (y1 > y2)
    {
        temp1 = y1;
        y1 = y2;
        y2 = temp1;
    }

    //determine the first page of line
    p1 = y1 >> 3;                        // identical to: p1 = y1 / 8;
    //determine the last page of line
    p2 = y2 >> 3;                        // identical to: p2 = y2 / 8;

    //mask for last page of line
    temp2 = 8 - (y2 & 0x07);            // identical to: temp2 = 8 - (y2 % 8);
    temp2--;
    temp2 = 0xFF << temp2;

    //mask for first page of line
    // Length that spans across multiple pages
    if (p1 != p2)
    {
        // Check if there is an offset
        if (y1 > 0)
        {
            temp1 = 0xFF00 >> (y1 & 0x07);         // identical to: temp1 = 0xFF00 >> (y1 % 8);
            temp1 = temp1 ^ 0xFF;
        }
        // If there is no offset, set all bits for lower mask
        else
        {
            temp1 = 0xFF;
        }
    }
    // Short length that only spans one page
    else
    {
        // Clear lower page bits
        temp1 = 0;

        // mask off y1 from top page bits
        a = y1 - (p1 * 8);
        a = 0xFF00 >> a;
        temp2 = temp2 ^ a;
    }

    // Prepare for first page of line
    if (style == DOGS102x6_DRAW_NORMAL)
    {
        dogs102x6Memory[2 + (p1 * 102) + x] |= temp1;
    }
    else
    {
        dogs102x6Memory[2 + (p1 * 102) + x] &= ~temp1;
    }

    // Set starting address for first page
    Dogs102x6_setAddress(p1, x);
    //draw first page of line
    Dogs102x6_writeData(dogs102x6Memory + (2 + (p1 * 102) + x), 1);

    a = p1 + 1;
    while (a < p2)
    {
        if (style == DOGS102x6_DRAW_NORMAL)
        {
            //draws a dark line through everything
            dogs102x6Memory[2 + (a * 102) + x] = 0xFF;
        }
        else
        {
            //draws a light line through everything
            dogs102x6Memory[2 + (a * 102) + x] &= 0x00;
        }
        Dogs102x6_setAddress(a, x);
        // draw middle of line
        Dogs102x6_writeData(dogs102x6Memory + (2 + (a * 102) + x), 1);
        a++;
    }

    // Prepare for last page of line
    if (style == DOGS102x6_DRAW_NORMAL)
    {
        dogs102x6Memory[2 + (p2 * 102) + x] |= temp2;
    }
    else
    {
        dogs102x6Memory[2 + (p2 * 102) + x] &= ~temp2;
    }

    Dogs102x6_setAddress(p2, x);
    //draw last page of line
    Dogs102x6_writeData(dogs102x6Memory + (2 + (p2 * 102) + x), 1);
}

/***************************************************************************//**
 * @brief  Draws a line from (x1,y1) to (x2,y2).
 *
 *         Uses Bresenham's line algorithm.
 *         (0,0) is the upper left corner of screen.
 * @param  x1   x-coordinate of the first point
 * @param  y    y-coordinate of the first point
 * @param  x2   x-coordinate of the second point
 * @param  y2   y-coordinate of the second point
 * @param   style The style of the line
 *                - NORMAL = 0 = dark line, overwrites
 *                - INVERT = 1 = inverts color on line
 * @return None
 ******************************************************************************/

