JinxinHu/MSP430f5529/temperature measurement/HAL_Dogs102x6.c
void Dogs102x6_lineDraw(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t style)
{
    int8_t x, y, deltay, deltax, d;
    int8_t x_dir, y_dir;

    //make sure we won't be writing off the screen
    if (y1 > 63)
    {
        y1 = 63;
    }

    if (y2 > 63)
    {
        y2 = 63;
    }

    if (x1 > 101)
    {
        x1 = 101;
    }

    if (x2 > 101)
    {
        x2 = 101;
    }

    // Check if vertical line. Use more efficient vertical line function
    if (x1 == x2)
    {
        Dogs102x6_verticalLineDraw(y1, y2, x1, style);
    }
    // Check if horizontal line. Use more efficient horizontal line function
    else if (y1 == y2)
    {
        Dogs102x6_horizontalLineDraw(x1, x2, y1, style);
    }
    // else it is a diagonal line
    else
    {
        if (x1 > x2)
        {
            x_dir = -1;
        }
        else
        {
            x_dir = 1;
        }

        if (y1 > y2)
        {
            y_dir = -1;
        }
        else
        {
            y_dir = 1;
        }

        x = x1;
        y = y1;
        deltay = abs(y2 - y1);
        deltax = abs(x2 - x1);

        if (deltax >= deltay)
        {
            d = (deltay << 1) - deltax;
            while (x != x2)
            {
                Dogs102x6_pixelDraw(x, y,  style);
                if (d < 0)
                    d += (deltay << 1);
                else
                {
                    d += ((deltay - deltax) << 1);
                    y += y_dir;
                }
                x += x_dir;
            }
        }
        else
        {
            d = (deltax << 1) - deltay;
            while (y != y2)
            {
                Dogs102x6_pixelDraw(x, y, style);
                if (d < 0)
                    d += (deltax << 1);
                else
                {
                    d += ((deltax - deltay) << 1);
                    x += x_dir;
                }
                y += y_dir;
            }
        }
    }
}

/***************************************************************************//**
 * @brief   Draw a circle of Radius with center at (x,y).
 *
 *          Uses Bresenham's circle algorithm.
 *          (0,0) is the upper left corner of screen.
 * @param   x   x-coordinate of the circle's center point
 * @param   y   y-coordinate of the circle's center point
 * @param   radius  Radius of the circle
 * @param   style The style of the circle
 *                - NORMAL = 0 = dark line, overwrites
 *                - INVERT = 1 = inverts color on line
 * @return  None
 ******************************************************************************/

void Dogs102x6_circleDraw(uint8_t x, uint8_t y, uint8_t radius, uint8_t style)
{
    int8_t xx, yy, ddF_x, ddF_y, f;

    ddF_x = 0;
    ddF_y = -(2 * radius);
    f = 1 - radius;

    xx = 0;
    yy = radius;
    Dogs102x6_pixelDraw(x + xx, y + yy, style);
    Dogs102x6_pixelDraw(x + xx, y - yy, style);
    Dogs102x6_pixelDraw(x - xx, y + yy, style);
    Dogs102x6_pixelDraw(x - xx, y - yy, style);
    Dogs102x6_pixelDraw(x + yy, y + xx, style);
    Dogs102x6_pixelDraw(x + yy, y - xx, style);
    Dogs102x6_pixelDraw(x - yy, y + xx, style);
    Dogs102x6_pixelDraw(x - yy, y - xx, style);
    while (xx < yy)
    {
        if (f >= 0)
        {
            yy--;
            ddF_y += 2;
            f += ddF_y;
        }
        xx++;
        ddF_x += 2;
        f += ddF_x + 1;
        Dogs102x6_pixelDraw(x + xx, y + yy, style);
        Dogs102x6_pixelDraw(x + xx, y - yy, style);
        Dogs102x6_pixelDraw(x - xx, y + yy, style);
        Dogs102x6_pixelDraw(x - xx, y - yy, style);
        Dogs102x6_pixelDraw(x + yy, y + xx, style);
        Dogs102x6_pixelDraw(x + yy, y - xx, style);
        Dogs102x6_pixelDraw(x - yy, y + xx, style);
        Dogs102x6_pixelDraw(x - yy, y - xx, style);
    }
}

/***************************************************************************//**
 * @brief   Loads an image of size = height * width, starting at (row,col).
 *          The first two bytes of the image should contain the width in pixels
 *          and the height in rows (height in rows = height in pixels/8)
 *
 *          (0,0) is the upper left corner of screen.
 * @param   image[] The image to be loaded.
 * @param   height  The number of rows in the image. Size = Rows * Columns.
 * @param   width   The number of columns in the image. Size = Rows * Columns.
 * @param   row     row of the image's starting location
 * @param   col     column of the image's starting location
 * @return None
 ******************************************************************************/

void Dogs102x6_imageDraw(const uint8_t IMAGE[], uint8_t row, uint8_t col)
{
    // height in rows (row = 8 pixels), width in columns
    uint8_t a, height, width;

    width = IMAGE[0];
    height = IMAGE[1];
    for (a = 0; a < height; a++)
    {
        Dogs102x6_setAddress(row + a, col);
        // Draw a row of the image
        Dogs102x6_writeData((uint8_t*)IMAGE + 2 + a * width, width);
    }
}

/***************************************************************************//**
 * @brief   Clears an area of size = height * width, starting at (row,col).
 *
 *          (0,0) is the upper left corner of screen.
 * @param   height  The number of rows in the image. Size = Rows * Columns.
 * @param   width   The number of columns in the image. Size = Rows * Columns.
 * @param   row row of the image's starting location
 * @param   col column of the image's starting location
 * @return None
 ******************************************************************************/

void Dogs102x6_clearImage(uint8_t height, uint8_t width, uint8_t row, uint8_t col)
{
    uint8_t a, b;
    uint8_t cmd[] = {0x00};

    for (a = 0; a < height; a++)
    {
        Dogs102x6_setAddress(row + a, col);
        for (b = 0; b < width; b++)
        {
            // clear a byte
            Dogs102x6_writeData(cmd, 1);
        }
    }
}


/***************************************************************************//**
 * @}
 ******************************************************************************/
